# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [48, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [96, 3, 2]],  # 1-P2/4
   [-1, 3, C3MS, [96]],
   [-1, 1, Conv, [192, 3, 2]],  # 3-P3/8
   [-1, 6, C3MS, [192]],
   [-1, 1, Conv, [384, 3, 2]],  # 5-P4/16
   [-1, 9, C3MS, [384]],
   [-1, 1, Conv, [768, 3, 2]],  # 7-P5/32
   [-1, 3, C3MS, [768]],
   [-1, 1, SPPFSplatt, [768, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [384, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3MS, [384, False]],  # 13

   [-1, 1, Conv, [192, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3MS, [192, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [192, 3, 2]],
   [[-1, 14, 6], 1, Concat, [1]],  # cat P4
   [-1, 3, C3MS, [384, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [384, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3MS, [768, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
